## When should I use the "inplace" parameter in pandas?

In [1]:
import pandas as pd

In [3]:
ufo=pd.read_csv('http://bit.ly/uforeports')

In [5]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [7]:
ufo.shape

(18241, 5)

In [11]:
ufo.drop('City', axis=1).head()

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00

drop method is used in the above code to remove City column from ufo dataframe. Next we will check if it is actually dropped.

In [12]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

city column is still present in dataframe.The reason is by default drop column has inplace=False that means that it will not effect the underlying data and can be checked using shift+tab on 'City' used in drop method. 

However this can be altered by using inplace=true. Below is an example.

In [13]:
ufo.drop('City', axis=1, inplace=True)

In [14]:
ufo.head()

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00

In [16]:
ufo.dropna(how='any').head()

   Colors Reported Shape Reported State             Time
12             RED         SPHERE    SC  6/30/1939 20:00
19             RED          OTHER    AK  4/30/1943 23:00
36             RED      FORMATION    VA   7/10/1945 1:30
44           GREEN         SPHERE    CA  6/30/1946 19:00
82            BLUE        CHEVRON    CA  7/15/1947 21:00